DataProcessors/ПланНаНеделю.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>ПланНаНеделю</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗадачи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Documents/РегистрацияВремени.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.14">
	<Document>
		<Properties>
			<Name>РегистрацияВремени</Name>
			<BasedOn>
				<xr:Item>Document.Задача</xr:Item>
				<xr:Item>Catalog.итк_Задача</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Время</xr:Item>
				<xr:Item>AccumulationRegister.Трудозатраты</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>JIRA_ID</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ITC_Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>РабочееВремя</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>256</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отчет</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>План</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Факт</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.итк_Часы</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

DataProcessors/ПланНаНеделю/Forms/ФормаНовогоНаряда/Ext/Form/Module.bsl
&НаСервере
Функция ЗаписатьНаряд()
	НарядОбъект = Документы.РегистрацияВремени.СоздатьДокумент();
	НарядОбъект.Дата = НачалоДня(ПланДатаНачала);
	НарядОбъект.ПланДатаНачала = ПланДатаНачала;
	НарядОбъект.ПланДатаОкончания = ПланДатаКонец;
	НарядОбъект.ДокументОснование = Задача;
	НарядОбъект.Описание = ЧтоСделать;
	НарядОбъект.Адрес = Адрес;
	НарядОбъект.НаВыезде = ЭтоВыезд;
	НарядОбъект.Ответственный = Ответственный;
	
	НарядОбъект.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НарядОбъект.Ссылка;
	
КонецФункции


&НаКлиенте
Процедура Записать(Команда)
	// Вставить содержимое обработчика.
	
	Наряд = ЗаписатьНаряд();
	ОповеститьОВыборе(Наряд);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
	Параметры.Свойство("Задача", Задача);
	Параметры.Свойство("Начало", ПланДатаНачала);
	Параметры.Свойство("Конец", ПланДатаКонец);
	Параметры.Свойство("Ответственный", Ответственный);

	
КонецПроцедуры
